## CityBike Data Prep

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from datetime import date

# Read in bike trip data

In [46]:
# CitiBike data
# Due to size of the data default to using Q4 of each year
df=pd.read_csv("201801-citibike-tripdata.csv", encoding="ISO-8859-1")
# df2=pd.read_csv("201701-citibike-tripdata.csv", encoding="ISO-8859-1")
df3=pd.read_csv("201601-citibike-tripdata.csv", encoding="ISO-8859-1")

In [47]:
df.head(2)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,970,2018-01-01 13:50:57.4340,2018-01-01 14:07:08.1860,72,W 52 St & 11 Ave,40.767272,-73.993929,505,6 Ave & W 33 St,40.749013,-73.988484,31956,Subscriber,1992,1
1,723,2018-01-01 15:33:30.1820,2018-01-01 15:45:33.3410,72,W 52 St & 11 Ave,40.767272,-73.993929,3255,8 Ave & W 31 St,40.750585,-73.994685,32536,Subscriber,1969,1

In [51]:
#Add columns
df['Month'] = 'January'
df['Year'] = '2018'
df.columns

Index(['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender', 'Month', 'Year'],
      dtype='object')

In [48]:
df3.head(2)

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender
0,923,1/1/2016 00:00:41,1/1/2016 00:16:04,268,Howard St & Centre St,40.719105,-73.999733,3002,South End Ave & Liberty St,40.711512,-74.015756,22285,Subscriber,1958.0,1
1,379,1/1/2016 00:00:45,1/1/2016 00:07:04,476,E 31 St & 3 Ave,40.743943,-73.979661,498,Broadway & W 32 St,40.748549,-73.988084,17827,Subscriber,1969.0,1

In [52]:
#Add columns
df3['Month'] = 'January'
df3['Year'] = '2016'
df3.columns

Index(['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year', 'gender', 'Month', 'Year'],
      dtype='object')

In [77]:
# Membership data 
df_m=pd.read_csv("2016_Q1_Membership.csv", encoding="ISO-8859-1")
# df_m2=pd.read_csv("2017_Q1_Membership.csv", encoding="ISO-8859-1")
df_m3=pd.read_csv("2018_Q1_Membership.csv", encoding="ISO-8859-1")

In [78]:
df_m.head(2)

,Date,Trips over the past 24-hours (midnight to 11:59pm),Cumulative trips (since launch):,Miles traveled today (midnight to 11:59 pm),Miles traveled to date:,Total Annual Members (All Time),24-Hour Passes Purchased (midnight to 11:59 pm),7-Day Passes Purchased (midnight to 11:59 pm)
0,1/1/2016,11009,24371025,24429,44606414,159362,919,51
1,1/2/2016,14587,24385612,29093,44635507,159403,877,34

In [79]:
df_m.columns

Index(['Date', 'Trips over the past 24-hours (midnight to 11:59pm)',
       'Cumulative trips (since launch):',
       'Miles traveled today (midnight to 11:59 pm)',
       'Miles traveled to date:', 'Total Annual Members (All Time)',
       '24-Hour Passes Purchased (midnight to 11:59 pm)',
       '7-Day Passes Purchased (midnight to 11:59 pm)'],
      dtype='object')

In [72]:
# df_m.drop(df_m.columns[[2]], axis=1, inplace=True)

In [80]:
df_m3.head(2)

,Date,Trips over the past 24-hours (midnight to 11:59pm),Miles traveled today (midnight to 11:59 pm),Total Annual Members (All Time),24-Hour Passes Purchased (midnight to 11:59 pm),3-Day Passes Purchased (midnight to 11:59 pm)
0,1/1/2018,5499,11483,253490,123,7
1,1/2/2018,18818,39352,253558,125,12

## Merge 2018 Data files

In [81]:
# Combine membership data into a single dataset (2016 to 2018)
merge = [df_m, df_m3]
member = pd.concat(merge, sort=True)
member.head()

,24-Hour Passes Purchased (midnight to 11:59 pm),3-Day Passes Purchased (midnight to 11:59 pm),7-Day Passes Purchased (midnight to 11:59 pm),Cumulative trips (since launch):,Date,Miles traveled to date:,Miles traveled today (midnight to 11:59 pm),Total Annual Members (All Time),Trips over the past 24-hours (midnight to 11:59pm)
0,919,NaN,51.0,24371025.0,1/1/2016,44606414.0,24429,159362,11009
1,877,NaN,34.0,24385612.0,1/2/2016,44635507.0,29093,159403,14587
2,784,NaN,27.0,24401111.0,1/3/2016,44665123.0,29616,159459,15499
3,166,NaN,33.0,24420704.0,1/4/2016,44701295.0,36172,159502,19593
4,121,NaN,22.0,24438757.0,1/5/2016,44733344.0,32049,159534,18053

In [84]:
# Combine trip data for the last 3  year: Month of January only
merge = [df, df3]
trip = pd.concat(merge, sort=True)
trip.head()

,Month,Year,bikeid,birth year,end station id,end station latitude,end station longitude,end station name,gender,start station id,start station latitude,start station longitude,start station name,starttime,stoptime,tripduration,usertype
0,January,2018,31956,1992.0,505,40.749013,-73.988484,6 Ave & W 33 St,1,72,40.767272,-73.993929,W 52 St & 11 Ave,2018-01-01 13:50:57.4340,2018-01-01 14:07:08.1860,970,Subscriber
1,January,2018,32536,1969.0,3255,40.750585,-73.994685,8 Ave & W 31 St,1,72,40.767272,-73.993929,W 52 St & 11 Ave,2018-01-01 15:33:30.1820,2018-01-01 15:45:33.3410,723,Subscriber
2,January,2018,16069,1956.0,525,40.755942,-74.002116,W 34 St & 11 Ave,1,72,40.767272,-73.993929,W 52 St & 11 Ave,2018-01-01 15:39:18.3370,2018-01-01 15:47:35.1720,496,Subscriber
3,January,2018,31781,1974.0,447,40.763707,-73.985162,8 Ave & W 52 St,1,72,40.767272,-73.993929,W 52 St & 11 Ave,2018-01-01 15:40:13.3720,2018-01-01 15:45:20.1910,306,Subscriber
4,January,2018,30319,1992.0,3356,40.774667,-73.984706,Amsterdam Ave & W 66 St,1,72,40.767272,-73.993929,W 52 St & 11 Ave,2018-01-01 18:14:51.5680,2018-01-01 18:19:57.6420,306,Subscriber

## Check for null values

In [87]:
member.isna().values.any()

True

In [88]:
member.count()

24-Hour Passes Purchased (midnight to 11:59 pm)       181
3-Day Passes Purchased (midnight to 11:59 pm)          90
7-Day Passes Purchased (midnight to 11:59 pm)          91
Cumulative trips (since launch):                       91
Date                                                  181
Miles traveled to date:                                91
Miles traveled today (midnight to 11:59 pm)           181
Total Annual Members (All Time)                       181
Trips over the past 24-hours (midnight to 11:59pm)    181
dtype: int64

In [94]:
# Check for NA values; may keep as part of analysis
trip.isna().values.any()

True

In [92]:
# count rows of combined data to analyze
trip['bikeid'].count()

1228472

In [101]:
new_trip = trip.dropna()
new_trip['bikeid'].count()

1203927

# Write out clean files for analysis in Tableau

In [103]:
# Write member file to csv
member.to_csv("Data/q1_Membership_16_18.csv", index=False, header=True)

In [102]:
# Write member file to csv
new_trip.to_csv("Data/Trips_16_18.csv", index=False, header=True)

# End data prep